In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "Name"  : ['A','Ad','Md','Rt','Ri'],
    "Marks" : [70,69,85,65,'70'],
    "City"  : ['Khandwa','itarsi','Bhopal','Harda','indore'],
    "Prof." : ['WebDev','Game Designer','UI/UX','Product Manager','Data-Analyst']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df.head()

      Name Marks     City            Prof.
0   Ashwin    70  Khandwa           WebDev
1   Aditya    69   itarsi    Game Designer
2   Mukund    85   Bhopal            UI/UX
3   Ritesh    65    Harda  Product Manager
4  Rishabh    70   indore     Data-Analyst

In [5]:
df.to_csv('Friends.csv')

In [6]:
df.to_csv('Friends_index_false.csv',index=False)

In [7]:
df.head(2)

     Name Marks     City          Prof.
0  Ashwin    70  Khandwa         WebDev
1  Aditya    69   itarsi  Game Designer

In [8]:
df.tail(1)

      Name Marks    City         Prof.
4  Rishabh    70  indore  Data-Analyst

In [12]:
 df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Marks   5 non-null      object
 2   City    5 non-null      object
 3   Prof.   5 non-null      object
dtypes: object(4)
memory usage: 288.0+ bytes

In [10]:
df.shape

(5, 4)

In [11]:
df.describe()

          Name  Marks   City   Prof.
count        5      5      5       5
unique       5      5      5       5
top     Mukund     69  Harda  WebDev
freq         1      1      1       1